In [1]:
import numpy as np
import pandas as pd

In [2]:
import zipfile
import os

In [7]:
df = pd.read_csv('./data/2018_잔액정보_통합.csv')
df.head()

     기준년월 발급회원번호   잔액_B0M  연체일수_B2M     월중평잔    평잔_3M    평잔_6M
0  201807  SYN_0  2493245 -99999999  1723710  1855770  1598898
1  201807  SYN_1   495634 -99999999   796777   703177   704504
2  201807  SYN_2        0 -99999999    45265   140861   114846
3  201807  SYN_3    25771 -99999999    12686    12461    12345
4  201807  SYN_4        0 -99999999        0        0        0

In [8]:
df['기준년월'].value_counts().sort_index()

기준년월
201807    3000000
201808    3000000
201809    3000000
201810    3000000
201811    3000000
201812    3000000
Name: count, dtype: int64

##### 05.카드 잔액정보

In [10]:
zip_path = './data/05.카드 잔액정보.zip'
extract_path = './data/05.카드 잔액정보'

with zipfile.ZipFile(zip_path, 'r') as zip_ref:
    zip_ref.extractall(extract_path)

print('압축 해제')

압축 해제

In [13]:
card_balance_07 = pd.read_csv('./data/05.카드 잔액정보/201807_잔액정보.csv')
card_balance_07.head()

,기준년월,발급회원번호,잔액_B0M,잔액_일시불_B0M,잔액_할부_B0M,잔액_현금서비스_B0M,잔액_리볼빙일시불이월_B0M,잔액_리볼빙CA이월_B0M,잔액_카드론_B0M,월중평잔_일시불_B0M,...,평잔_6M,평잔_일시불_6M,평잔_일시불_해외_6M,평잔_RV일시불_6M,평잔_RV일시불_해외_6M,평잔_할부_6M,평잔_할부_해외_6M,평잔_CA_6M,평잔_CA_해외_6M,평잔_카드론_6M
0,201807,SYN_0,2493245,99811,96281,2297153,0,0,0,108404,...,1598898,244003,0,0,0,57273,0,1700813,0,0
1,201807,SYN_1,495634,256579,239055,0,0,0,0,409061,...,704504,267764,0,283025,0,273649,0,0,0,0
2,201807,SYN_2,0,0,0,0,0,0,0,0,...,114846,120720,0,0,0,0,0,0,0,0
3,201807,SYN_3,25771,25771,0,0,0,0,0,19933,...,12345,11593,0,66245,0,0,0,0,0,0
4,201807,SYN_4,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [15]:
# 컬럼 추출

cols_7 = ['기준년월', '발급회원번호', '잔액_B0M', '연체일수_B2M', '월중평잔', '평잔_3M', '평잔_6M']

card_07 = card_balance_07[cols_7]
card_07.head()

     기준년월 발급회원번호   잔액_B0M  연체일수_B2M     월중평잔    평잔_3M    평잔_6M
0  201807  SYN_0  2493245 -99999999  1723710  1855770  1598898
1  201807  SYN_1   495634 -99999999   796777   703177   704504
2  201807  SYN_2        0 -99999999    45265   140861   114846
3  201807  SYN_3    25771 -99999999    12686    12461    12345
4  201807  SYN_4        0 -99999999        0        0        0

In [27]:
card_balance_07['연체일수_B2M']

0         -99999999
1         -99999999
2         -99999999
3         -99999999
4         -99999999
             ...
2999995   -99999999
2999996   -99999999
2999997   -99999999
2999998   -99999999
2999999   -99999999
Name: 연체일수_B2M, Length: 3000000, dtype: int64

In [20]:
card_balance_08 = pd.read_csv('./data/05.카드 잔액정보/201808_잔액정보.csv')
card_balance_08.head()

,기준년월,발급회원번호,잔액_B0M,잔액_일시불_B0M,잔액_할부_B0M,잔액_현금서비스_B0M,잔액_리볼빙일시불이월_B0M,잔액_리볼빙CA이월_B0M,잔액_카드론_B0M,월중평잔_일시불_B0M,...,평잔_6M,평잔_일시불_6M,평잔_일시불_해외_6M,평잔_RV일시불_6M,평잔_RV일시불_해외_6M,평잔_할부_6M,평잔_할부_해외_6M,평잔_CA_6M,평잔_CA_해외_6M,평잔_카드론_6M
0,201808,SYN_0,2592949,78082,93691,2421176,0,0,0,109219,...,2080772,269704,0,0,0,62772,0,1905014,0,0
1,201808,SYN_1,491666,289852,201814,0,0,0,0,285085,...,689496,254741,0,295172,0,264851,0,0,0,0
2,201808,SYN_2,0,0,0,0,0,0,0,0,...,109672,122872,0,0,0,0,0,0,0,0
3,201808,SYN_3,28633,28633,0,0,0,0,0,25018,...,15526,15382,0,78820,0,0,0,0,0,0
4,201808,SYN_4,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [21]:
# 컬럼 추출

cols_8 = ['기준년월', '발급회원번호', '잔액_B0M', '연체일수_B2M', '월중평잔', '평잔_3M', '평잔_6M']

card_08 = card_balance_08[cols_8]
card_08.head()

     기준년월 발급회원번호   잔액_B0M  연체일수_B2M     월중평잔    평잔_3M    평잔_6M
0  201808  SYN_0  2592949 -99999999  1703999  1974366  2080772
1  201808  SYN_1   491666 -99999999   645489   696664   689496
2  201808  SYN_2        0 -99999999        0    87108   109672
3  201808  SYN_3    28633 -99999999    15853    14265    15526
4  201808  SYN_4        0 -99999999        0        0        0

In [22]:
card_balance_09 = pd.read_csv('./data/05.카드 잔액정보/201809_잔액정보.csv')
card_balance_09.head()

# 컬럼 추출

cols_9 = ['기준년월', '발급회원번호', '잔액_B0M', '연체일수_B2M', '월중평잔', '평잔_3M', '평잔_6M']

card_09 = card_balance_09[cols_9]
card_09.head()

     기준년월 발급회원번호   잔액_B0M  연체일수_B2M     월중평잔    평잔_3M    평잔_6M
0  201809  SYN_0  2643108 -99999999  2058706  2398743  2608374
1  201809  SYN_1   462454 -99999999   565413   637984   746289
2  201809  SYN_2        0 -99999999        0    21526   101309
3  201809  SYN_3    32578 -99999999    17903    15987    16941
4  201809  SYN_4        0 -99999999        0        0        0

In [23]:
card_balance_10 = pd.read_csv('./data/05.카드 잔액정보/201810_잔액정보.csv')
print(card_balance_10.head())

# 컬럼 추출

cols_10 = ['기준년월', '발급회원번호', '잔액_B0M', '연체일수_B2M', '월중평잔', '평잔_3M', '평잔_6M']

card_10 = card_balance_10[cols_10]
card_10.head()

     기준년월 발급회원번호   잔액_B0M  잔액_일시불_B0M  잔액_할부_B0M  잔액_현금서비스_B0M  \
0  201810  SYN_0  2597681       70554      90305       2436822
1  201810  SYN_1   436830      266955     169875             0
2  201810  SYN_2        0           0          0             0
3  201810  SYN_3    34286       34286          0             0
4  201810  SYN_4        0           0          0             0

   잔액_리볼빙일시불이월_B0M  잔액_리볼빙CA이월_B0M  잔액_카드론_B0M  월중평잔_일시불_B0M  ...    평잔_6M  \
0                0               0           0         85740  ...  2557575
1                0               0           0        257738  ...   679469
2                0               0           0             0  ...    67743
3                0               0           0         30485  ...    18633
4                0               0           0             0  ...        0

   평잔_일시불_6M  평잔_일시불_해외_6M  평잔_RV일시불_6M  평잔_RV일시불_해외_6M  평잔_할부_6M  \
0     256292             0            0               0     59384
1     294516             0       277699               0    222705
2      54752             0            0               0         0
3      19233             0        87912               0         0
4          0             0            0               0         0

   평잔_할부_해외_6M  평잔_CA_6M  평잔_CA_해외_6M  평잔_카드론_6M
0            0   2026810            0          0
1            0         0            0          0
2            0         0            0          0
3            0         0            0          0
4            0         0            0          0

[5 rows x 83 columns]

     기준년월 발급회원번호   잔액_B0M  연체일수_B2M     월중평잔    평잔_3M    평잔_6M
0  201810  SYN_0  2597681 -99999999  1745094  2391893  2557575
1  201810  SYN_1   436830 -99999999   544499   535682   679469
2  201810  SYN_2        0 -99999999        0        0    67743
3  201810  SYN_3    34286 -99999999    19734    17853    18633
4  201810  SYN_4        0 -99999999        0        0        0

In [24]:
card_balance_11 = pd.read_csv('./data/05.카드 잔액정보/201811_잔액정보.csv')
print(card_balance_11.head())

# 컬럼 추출

cols_11 = ['기준년월', '발급회원번호', '잔액_B0M', '연체일수_B2M', '월중평잔', '평잔_3M', '평잔_6M']

card_11 = card_balance_11[cols_11]
card_11.head()

     기준년월 발급회원번호   잔액_B0M  잔액_일시불_B0M  잔액_할부_B0M  잔액_현금서비스_B0M  \
0  201811  SYN_0  2585834       68424      87697       2429713
1  201811  SYN_1   404741      234926     169815             0
2  201811  SYN_2        0           0          0             0
3  201811  SYN_3    35586       35586          0             0
4  201811  SYN_4        0           0          0             0

   잔액_리볼빙일시불이월_B0M  잔액_리볼빙CA이월_B0M  잔액_카드론_B0M  월중평잔_일시불_B0M  ...    평잔_6M  \
0                0               0           0         83577  ...  2597336
1                0               0           0        242604  ...   620353
2                0               0           0             0  ...    50923
3                0               0           0         31733  ...    19533
4                0               0           0             0  ...        0

   평잔_일시불_6M  평잔_일시불_해외_6M  평잔_RV일시불_6M  평잔_RV일시불_해외_6M  평잔_할부_6M  \
0     243142             0            0               0     61415
1     269227             0       278615               0    242236
2      49095             0            0               0         0
3      20041             0        90390               0         0
4          0             0            0               0         0

   평잔_할부_해외_6M  평잔_CA_6M  평잔_CA_해외_6M  평잔_카드론_6M
0            0   2056464            0          0
1            0         0            0          0
2            0         0            0          0
3            0         0            0          0
4            0         0            0          0

[5 rows x 83 columns]

     기준년월 발급회원번호   잔액_B0M  연체일수_B2M     월중평잔    평잔_3M    평잔_6M
0  201811  SYN_0  2585834 -99999999  1742698  2269146  2597336
1  201811  SYN_1   404741 -99999999   472036   477060   620353
2  201811  SYN_2        0 -99999999        0        0    50923
3  201811  SYN_3    35586 -99999999    20805    18946    19533
4  201811  SYN_4        0 -99999999        0        0        0

In [25]:
card_balance_12 = pd.read_csv('./data/05.카드 잔액정보/201812_잔액정보.csv')
print(card_balance_12.head())

# 컬럼 추출

cols_12 = ['기준년월', '발급회원번호', '잔액_B0M', '연체일수_B2M', '월중평잔', '평잔_3M', '평잔_6M']

card_12 = card_balance_12[cols_12]
card_12.head()

     기준년월 발급회원번호   잔액_B0M  잔액_일시불_B0M  잔액_할부_B0M  잔액_현금서비스_B0M  \
0  201812  SYN_0  2557102       68736      86610       2401756
1  201812  SYN_1   375625      226490     149135             0
2  201812  SYN_2        0           0          0             0
3  201812  SYN_3    36400       36400          0             0
4  201812  SYN_4        0           0          0             0

   잔액_리볼빙일시불이월_B0M  잔액_리볼빙CA이월_B0M  잔액_카드론_B0M  월중평잔_일시불_B0M  ...    평잔_6M  \
0                0               0           0         85038  ...  2575593
1                0               0           0        222230  ...   616807
2                0               0           0             0  ...    25792
3                0               0           0         32581  ...    20494
4                0               0           0             0  ...        0

   평잔_일시불_6M  평잔_일시불_해외_6M  평잔_RV일시불_6M  평잔_RV일시불_해외_6M  평잔_할부_6M  \
0     233781             0            0               0     62694
1     286545             0       262995               0    193718
2      24588             0            0               0         0
3      21113             0        91267               0         0
4          0             0            0               0         0

   평잔_할부_해외_6M  평잔_CA_6M  평잔_CA_해외_6M  평잔_카드론_6M
0            0   2083754            0          0
1            0         0            0          0
2            0         0            0          0
3            0         0            0          0
4            0         0            0          0

[5 rows x 83 columns]

     기준년월 발급회원번호   잔액_B0M  연체일수_B2M     월중평잔    평잔_3M    평잔_6M
0  201812  SYN_0  2557102 -99999999  1700963  2134379  2575593
1  201812  SYN_1   375625 -99999999   432167   415501   616807
2  201812  SYN_2        0 -99999999        0    86299    25792
3  201812  SYN_3    36400 -99999999    21735    19804    20494
4  201812  SYN_4        0 -99999999        0        0        0

In [26]:
card_balance_05 = pd.concat([card_07, card_08, card_09, card_10, card_11, card_12], axis = 0, ignore_index = True)

card_balance_05.head()

     기준년월 발급회원번호   잔액_B0M  연체일수_B2M     월중평잔    평잔_3M    평잔_6M
0  201807  SYN_0  2493245 -99999999  1723710  1855770  1598898
1  201807  SYN_1   495634 -99999999   796777   703177   704504
2  201807  SYN_2        0 -99999999    45265   140861   114846
3  201807  SYN_3    25771 -99999999    12686    12461    12345
4  201807  SYN_4        0 -99999999        0        0        0

In [29]:
card_balance_05['기준년월'].value_counts().sort_index()

기준년월
201807    3000000
201808    3000000
201809    3000000
201810    3000000
201811    3000000
201812    3000000
Name: count, dtype: int64

In [33]:
card_balance_05.to_csv('./data/2018_잔액정보_통합.csv',
                       index=False,
                       encoding='utf-8-sig')

##### 06.카드 채널정보

In [31]:
zip_path = './data/06.카드 채널정보.zip'
extract_path = './data/06.카드 채널정보'

with zipfile.ZipFile(zip_path, 'r') as zip_ref:
    zip_ref.extractall(extract_path)

print('압축 해제')

압축 해제

In [32]:
card_channel_07 = pd.read_csv('./data/06.카드 채널정보/201807_채널정보.csv')
card_channel_07.head()

,기준년월,발급회원번호,인입횟수_ARS_R6M,이용메뉴건수_ARS_R6M,인입일수_ARS_R6M,인입월수_ARS_R6M,인입후경과월_ARS,인입횟수_ARS_B0M,이용메뉴건수_ARS_B0M,인입일수_ARS_B0M,...,당사PAY_방문횟수_R6M,당사PAY_방문월수_R6M,당사멤버쉽_방문횟수_B0M,당사멤버쉽_방문횟수_R6M,당사멤버쉽_방문월수_R6M,OS구분코드,홈페이지_금융건수_R6M,홈페이지_선결제건수_R6M,홈페이지_금융건수_R3M,홈페이지_선결제건수_R3M
0,201807,SYN_0,10,10,8,6,0,2,6,2,...,0,0,22,221,6,4.0,0,0,0,0
1,201807,SYN_1,0,0,0,0,0,0,0,0,...,0,0,0,0,0,NaN,0,0,0,0
2,201807,SYN_2,0,0,0,0,0,0,0,0,...,0,0,0,0,0,NaN,0,0,0,0
3,201807,SYN_3,0,0,0,0,0,0,0,0,...,0,0,0,0,0,NaN,0,0,0,0
4,201807,SYN_4,0,0,0,0,0,0,0,0,...,0,0,0,0,0,NaN,0,0,0,0

In [34]:
# 컬럼 추출

cols_channel_7 = ['기준년월', '발급회원번호', '불만제기건수_B0M', '불만제기건수_R12M']

channel_07 = card_channel_07[cols_channel_7]
channel_07.head()

     기준년월 발급회원번호  불만제기건수_B0M  불만제기건수_R12M
0  201807  SYN_0           0            0
1  201807  SYN_1           0            0
2  201807  SYN_2           0            0
3  201807  SYN_3           0            0
4  201807  SYN_4           0            0

In [35]:
card_channel_08 = pd.read_csv('./data/06.카드 채널정보/201808_채널정보.csv')
print(card_channel_08.head())

# 컬럼 추출

cols_channel_8 = ['기준년월', '발급회원번호', '불만제기건수_B0M', '불만제기건수_R12M']

channel_08 = card_channel_08[cols_channel_8]
channel_08.head()

     기준년월 발급회원번호  인입횟수_ARS_R6M  이용메뉴건수_ARS_R6M  인입일수_ARS_R6M  인입월수_ARS_R6M  \
0  201808  SYN_0            11              11             9             6
1  201808  SYN_1             0               0             0             0
2  201808  SYN_2             0               0             0             0
3  201808  SYN_3             0               0             0             0
4  201808  SYN_4             0               0             0             0

   인입후경과월_ARS  인입횟수_ARS_B0M  이용메뉴건수_ARS_B0M  인입일수_ARS_B0M  ...  \
0           0             2               6             2  ...
1           0             0               0             0  ...
2           0             0               0             0  ...
3           0             0               0             0  ...
4           0             0               0             0  ...

   당사PAY_방문횟수_R6M  당사PAY_방문월수_R6M  당사멤버쉽_방문횟수_B0M  당사멤버쉽_방문횟수_R6M  \
0               0               0              23             221
1               0               0               0               0
2               0               0               0               0
3               0               0               0               0
4               0               0               0               0

   당사멤버쉽_방문월수_R6M  OS구분코드  홈페이지_금융건수_R6M  홈페이지_선결제건수_R6M  홈페이지_금융건수_R3M  \
0               6     4.0              0               0              0
1               0     NaN              0               0              0
2               0     NaN              0               0              0
3               0     NaN              0               0              0
4               0     NaN              0               0              0

   홈페이지_선결제건수_R3M
0               0
1               0
2               0
3               0
4               0

[5 rows x 105 columns]

     기준년월 발급회원번호  불만제기건수_B0M  불만제기건수_R12M
0  201808  SYN_0           0            0
1  201808  SYN_1           0            0
2  201808  SYN_2           0            0
3  201808  SYN_3           0            0
4  201808  SYN_4           0            0

In [36]:
card_channel_09 = pd.read_csv('./data/06.카드 채널정보/201809_채널정보.csv')
print(card_channel_09.head())

# 컬럼 추출

cols_channel_9 = ['기준년월', '발급회원번호', '불만제기건수_B0M', '불만제기건수_R12M']

channel_09 = card_channel_09[cols_channel_9]
channel_09.head()

     기준년월 발급회원번호  인입횟수_ARS_R6M  이용메뉴건수_ARS_R6M  인입일수_ARS_R6M  인입월수_ARS_R6M  \
0  201809  SYN_0            12              11             9             6
1  201809  SYN_1             0               0             0             0
2  201809  SYN_2             0               0             0             0
3  201809  SYN_3             0               0             0             0
4  201809  SYN_4             0               0             0             0

   인입후경과월_ARS  인입횟수_ARS_B0M  이용메뉴건수_ARS_B0M  인입일수_ARS_B0M  ...  \
0           0             2               6             2  ...
1           0             0               0             0  ...
2           0             0               0             0  ...
3           0             0               0             0  ...
4           0             0               0             0  ...

   당사PAY_방문횟수_R6M  당사PAY_방문월수_R6M  당사멤버쉽_방문횟수_B0M  당사멤버쉽_방문횟수_R6M  \
0               0               0              23             222
1               0               0               0               0
2               0               0               0               0
3               0               0               0               0
4               0               0               0               0

   당사멤버쉽_방문월수_R6M  OS구분코드  홈페이지_금융건수_R6M  홈페이지_선결제건수_R6M  홈페이지_금융건수_R3M  \
0               6     4.0              0               0              0
1               0     NaN              0               0              0
2               0     NaN              0               0              0
3               0     NaN              0               0              0
4               0     NaN              0               0              0

   홈페이지_선결제건수_R3M
0               0
1               0
2               0
3               0
4               0

[5 rows x 105 columns]

     기준년월 발급회원번호  불만제기건수_B0M  불만제기건수_R12M
0  201809  SYN_0           0            0
1  201809  SYN_1           0            0
2  201809  SYN_2           0            0
3  201809  SYN_3           0            0
4  201809  SYN_4           0            0

In [38]:
card_channel_10 = pd.read_csv('./data/06.카드 채널정보/201810_채널정보.csv')
print(card_channel_09.head())

# 컬럼 추출

cols_channel_10 = ['기준년월', '발급회원번호', '불만제기건수_B0M', '불만제기건수_R12M']

channel_10 = card_channel_10[cols_channel_10]
channel_10.head()

     기준년월 발급회원번호  인입횟수_ARS_R6M  이용메뉴건수_ARS_R6M  인입일수_ARS_R6M  인입월수_ARS_R6M  \
0  201809  SYN_0            12              11             9             6
1  201809  SYN_1             0               0             0             0
2  201809  SYN_2             0               0             0             0
3  201809  SYN_3             0               0             0             0
4  201809  SYN_4             0               0             0             0

   인입후경과월_ARS  인입횟수_ARS_B0M  이용메뉴건수_ARS_B0M  인입일수_ARS_B0M  ...  \
0           0             2               6             2  ...
1           0             0               0             0  ...
2           0             0               0             0  ...
3           0             0               0             0  ...
4           0             0               0             0  ...

   당사PAY_방문횟수_R6M  당사PAY_방문월수_R6M  당사멤버쉽_방문횟수_B0M  당사멤버쉽_방문횟수_R6M  \
0               0               0              23             222
1               0               0               0               0
2               0               0               0               0
3               0               0               0               0
4               0               0               0               0

   당사멤버쉽_방문월수_R6M  OS구분코드  홈페이지_금융건수_R6M  홈페이지_선결제건수_R6M  홈페이지_금융건수_R3M  \
0               6     4.0              0               0              0
1               0     NaN              0               0              0
2               0     NaN              0               0              0
3               0     NaN              0               0              0
4               0     NaN              0               0              0

   홈페이지_선결제건수_R3M
0               0
1               0
2               0
3               0
4               0

[5 rows x 105 columns]

     기준년월 발급회원번호  불만제기건수_B0M  불만제기건수_R12M
0  201810  SYN_0           0            0
1  201810  SYN_1           0            0
2  201810  SYN_2           0            0
3  201810  SYN_3           0            0
4  201810  SYN_4           0            0

In [39]:
card_channel_11 = pd.read_csv('./data/06.카드 채널정보/201811_채널정보.csv')
print(card_channel_11.head())

# 컬럼 추출

cols_channel_11 = ['기준년월', '발급회원번호', '불만제기건수_B0M', '불만제기건수_R12M']

channel_11 = card_channel_11[cols_channel_11]
channel_11.head()

     기준년월 발급회원번호  인입횟수_ARS_R6M  이용메뉴건수_ARS_R6M  인입일수_ARS_R6M  인입월수_ARS_R6M  \
0  201811  SYN_0            13              12            10             6
1  201811  SYN_1             0               0             0             0
2  201811  SYN_2             0               0             0             0
3  201811  SYN_3             0               0             0             0
4  201811  SYN_4             0               0             0             0

   인입후경과월_ARS  인입횟수_ARS_B0M  이용메뉴건수_ARS_B0M  인입일수_ARS_B0M  ...  \
0           0             2               6             2  ...
1           0             0               0             0  ...
2           0             0               0             0  ...
3           0             0               0             0  ...
4           0             0               0             0  ...

   당사PAY_방문횟수_R6M  당사PAY_방문월수_R6M  당사멤버쉽_방문횟수_B0M  당사멤버쉽_방문횟수_R6M  \
0               0               0              23             222
1               0               0               0               0
2               0               0               0               0
3               0               0               0               0
4               0               0               0               0

   당사멤버쉽_방문월수_R6M  OS구분코드  홈페이지_금융건수_R6M  홈페이지_선결제건수_R6M  홈페이지_금융건수_R3M  \
0               6     4.0              0               0              0
1               0     NaN              0               0              0
2               0     NaN              0               0              0
3               0     NaN              0               0              0
4               0     NaN              0               0              0

   홈페이지_선결제건수_R3M
0               0
1               0
2               0
3               0
4               0

[5 rows x 105 columns]

     기준년월 발급회원번호  불만제기건수_B0M  불만제기건수_R12M
0  201811  SYN_0           0            0
1  201811  SYN_1           0            0
2  201811  SYN_2           0            0
3  201811  SYN_3           0            0
4  201811  SYN_4           0            0

In [40]:
card_channel_12 = pd.read_csv('./data/06.카드 채널정보/201812_채널정보.csv')
print(card_channel_12.head())

# 컬럼 추출

cols_channel_12 = ['기준년월', '발급회원번호', '불만제기건수_B0M', '불만제기건수_R12M']

channel_12 = card_channel_12[cols_channel_12]
channel_12.head()

     기준년월 발급회원번호  인입횟수_ARS_R6M  이용메뉴건수_ARS_R6M  인입일수_ARS_R6M  인입월수_ARS_R6M  \
0  201812  SYN_0            12              36            12             6
1  201812  SYN_1             0               0             0             0
2  201812  SYN_2             0               0             0             0
3  201812  SYN_3             0               0             0             0
4  201812  SYN_4             0               0             0             0

   인입후경과월_ARS  인입횟수_ARS_B0M  이용메뉴건수_ARS_B0M  인입일수_ARS_B0M  ...  \
0           0             2               6             2  ...
1           0             0               0             0  ...
2           0             0               0             0  ...
3           0             0               0             0  ...
4           0             0               0             0  ...

   당사PAY_방문횟수_R6M  당사PAY_방문월수_R6M  당사멤버쉽_방문횟수_B0M  당사멤버쉽_방문횟수_R6M  \
0               0               0              23             136
1               0               0               0               0
2               0               0               0               0
3               0               0               0               0
4               0               0               0               0

   당사멤버쉽_방문월수_R6M  OS구분코드  홈페이지_금융건수_R6M  홈페이지_선결제건수_R6M  홈페이지_금융건수_R3M  \
0               6     4.0              0               0              0
1               0     NaN              0               0              0
2               0     NaN              0               0              0
3               0     NaN              0               0              0
4               0     NaN              0               0              0

   홈페이지_선결제건수_R3M
0               0
1               0
2               0
3               0
4               0

[5 rows x 105 columns]

     기준년월 발급회원번호  불만제기건수_B0M  불만제기건수_R12M
0  201812  SYN_0           0            0
1  201812  SYN_1           0            0
2  201812  SYN_2           0            0
3  201812  SYN_3           0            0
4  201812  SYN_4           0            0

In [41]:
card_channel_6 = pd.concat([channel_07, channel_08, channel_09, channel_10, channel_11, channel_12], axis = 0, ignore_index = True)

card_channel_6.head()

     기준년월 발급회원번호  불만제기건수_B0M  불만제기건수_R12M
0  201807  SYN_0           0            0
1  201807  SYN_1           0            0
2  201807  SYN_2           0            0
3  201807  SYN_3           0            0
4  201807  SYN_4           0            0

In [5]:
card_channel_6['기준년월'].value_counts().sort_index()

NameError: name 'card_channel_6' is not defined

In [43]:
card_balance_05.to_csv('./data/2018_채널정보_통합.csv',
                       index=False,
                       encoding='utf-8-sig')

### 03.카드 승인매출정보

In [44]:
zip_path = './data/03.카드 승인매출정보.zip'
extract_path = './data/03.카드 승인매출정보'

with zipfile.ZipFile(zip_path, 'r') as zip_ref:
    zip_ref.extractall(extract_path)
    

print('압축 해제')

압축 해제

In [3]:
card_sales_07 = pd.read_csv('./data/03.카드 승인매출정보/201807_승인매출정보.csv')
print(card_sales_07.head())

# 컬럼 추출

cols_sales_07 = [
    '기준년월',
    '발급회원번호',
    '최종이용일자_신판',
    '이용건수_신용_B0M',
    '이용금액_신용_B0M',
    '이용후경과월_신용',
    '이용건수_신용_R12M',
    '이용금액_신용_R12M',
    '이용가맹점수',
    '이용금액_업종기준',
    '이용금액_쇼핑',
    '이용금액_요식',
    '이용금액_교통',
    '이용금액_의료',
    '이용금액_납부',
    '이용금액_교육',
    '이용금액_여유생활',
    '이용금액_사교활동',
    '이용금액_일상생활',
    '이용금액_해외',
    'RP건수_B0M',
    'RP금액_B0M',
    '이용금액대'
]

sales_07 = card_sales_07[cols_sales_07]
sales_07.head()

     기준년월 발급회원번호  최종이용일자_기본  최종이용일자_신판  최종이용일자_CA  최종이용일자_카드론  최종이용일자_체크  \
0  201807  SYN_0   20180719   20180713   20180719       10101   20180203
1  201807  SYN_1   20180719   20180719   20170728    20170327      10101
2  201807  SYN_2   20150731   20150731      10101       10101      10101
3  201807  SYN_3   20180728   20180728   20130201       10101      10101
4  201807  SYN_4   20171111   20171111      10101       10101      10101

   최종이용일자_일시불  최종이용일자_할부  이용건수_신용_B0M  ...  승인거절건수_한도초과_B0M  승인거절건수_BL_B0M  \
0    20180709   20180713           11  ...                0              0
1    20180719   20171231           13  ...                0              0
2    20150731      10101           -3  ...                0              0
3    20180728   20140531            5  ...                0              0
4    20171111   20170501           -1  ...                0              0

   승인거절건수_입력오류_B0M  승인거절건수_기타_B0M  승인거절건수_R3M  승인거절건수_한도초과_R3M  승인거절건수_BL_R3M  \
0                0              0           3                3              0
1                0              0           3                3              0
2                0              0           0                0              0
3                0              0           0                0              0
4                0              0           0                0              0

   승인거절건수_입력오류_R3M  승인거절건수_기타_R3M      이용금액대
0                0              0  01.100만원+
1                0              0   03.30만원+
2                0              0   04.10만원+
3                0              0   05.10만원-
4                0              0     09.미사용

[5 rows x 430 columns]

,기준년월,발급회원번호,최종이용일자_신판,이용건수_신용_B0M,이용금액_신용_B0M,이용후경과월_신용,이용건수_신용_R12M,이용금액_신용_R12M,이용가맹점수,이용금액_업종기준,...,이용금액_의료,이용금액_납부,이용금액_교육,이용금액_여유생활,이용금액_사교활동,이용금액_일상생활,이용금액_해외,RP건수_B0M,RP금액_B0M,이용금액대
0,201807,SYN_0,20180713,11,1420432,0,165,13391066,6,532697,...,46086,192847,0,0,67281,34349,0,2,14790,01.100만원+
1,201807,SYN_1,20180719,13,286211,0,204,6477338,32,1384347,...,89730,208328,0,0,162964,0,0,0,0,03.30만원+
2,201807,SYN_2,20150731,-3,0,0,-1,904198,5,327673,...,0,0,0,0,70739,0,0,0,0,04.10만원+
3,201807,SYN_3,20180728,5,28771,4,44,257478,1,49490,...,0,0,0,0,0,0,0,0,0,05.10만원-
4,201807,SYN_4,20171111,-1,0,8,4,664057,0,0,...,0,0,0,0,0,0,0,0,0,09.미사용

In [9]:

cols_sales = [
    '기준년월','발급회원번호','최종이용일자_신판',
    '이용건수_신용_B0M','이용금액_신용_B0M','이용후경과월_신용',
    '이용건수_신용_R12M','이용금액_신용_R12M','이용가맹점수',
    '이용금액_업종기준','이용금액_쇼핑','이용금액_요식','이용금액_교통',
    '이용금액_의료','이용금액_납부','이용금액_교육','이용금액_여유생활',
    '이용금액_사교활동','이용금액_일상생활','이용금액_해외',
    'RP건수_B0M','RP금액_B0M','이용금액대'
]

sales_08 = pd.read_csv(
    './data/03.카드 승인매출정보/201808_승인매출정보.csv',
    usecols=cols_sales
)

sales_08.head()

,기준년월,발급회원번호,최종이용일자_신판,이용건수_신용_B0M,이용금액_신용_B0M,이용후경과월_신용,이용건수_신용_R12M,이용금액_신용_R12M,이용가맹점수,이용금액_업종기준,...,이용금액_의료,이용금액_납부,이용금액_교육,이용금액_여유생활,이용금액_사교활동,이용금액_일상생활,이용금액_해외,RP건수_B0M,RP금액_B0M,이용금액대
0,201808,SYN_0,20180816,7,1321346,0,159,14100338,5,605342,...,0,200076,0,0,73493,33991,0,2,11847,01.100만원+
1,201808,SYN_1,20180826,14,304772,0,193,5874342,33,1467877,...,90890,220653,0,0,179856,0,0,0,0,03.30만원+
2,201808,SYN_2,20150731,-2,0,0,17,951987,1,135553,...,0,0,0,0,69658,0,0,0,0,04.10만원+
3,201808,SYN_3,20180822,6,41404,4,44,331883,1,49398,...,0,0,0,0,0,0,0,0,0,05.10만원-
4,201808,SYN_4,20171111,-1,0,8,7,625453,0,0,...,0,0,0,0,0,0,0,0,0,09.미사용

In [ ]:
card_sales_09 = pd.read_csv('./data/03.카드 승인매출정보/201809_승인매출정보.csv')
print(card_sales_09.head())

# 컬럼 추출

sales_09 = card_sales_09[cols_sales]
sales_09.head()

In [10]:

cols_sales = [
    '기준년월','발급회원번호','최종이용일자_신판',
    '이용건수_신용_B0M','이용금액_신용_B0M','이용후경과월_신용',
    '이용건수_신용_R12M','이용금액_신용_R12M','이용가맹점수',
    '이용금액_업종기준','이용금액_쇼핑','이용금액_요식','이용금액_교통',
    '이용금액_의료','이용금액_납부','이용금액_교육','이용금액_여유생활',
    '이용금액_사교활동','이용금액_일상생활','이용금액_해외',
    'RP건수_B0M','RP금액_B0M','이용금액대'
]

sales_09 = pd.read_csv(
    './data/03.카드 승인매출정보/201809_승인매출정보.csv',
    usecols=cols_sales
)

sales_09.head()

,기준년월,발급회원번호,최종이용일자_신판,이용건수_신용_B0M,이용금액_신용_B0M,이용후경과월_신용,이용건수_신용_R12M,이용금액_신용_R12M,이용가맹점수,이용금액_업종기준,...,이용금액_의료,이용금액_납부,이용금액_교육,이용금액_여유생활,이용금액_사교활동,이용금액_일상생활,이용금액_해외,RP건수_B0M,RP금액_B0M,이용금액대
0,201809,SYN_0,20180906,7,1357957,0,169,15255138,6,729693,...,46492,205251,0,0,83535,33558,0,2,9695,01.100만원+
1,201809,SYN_1,20180921,11,277902,0,180,6208936,28,962432,...,88899,224853,0,0,133872,0,0,0,0,03.30만원+
2,201809,SYN_2,20150731,0,0,2,48,1061476,1,161709,...,0,0,0,0,0,0,0,0,0,09.미사용
3,201809,SYN_3,20180920,6,51044,4,47,390454,1,56352,...,0,0,0,0,0,0,0,0,0,05.10만원-
4,201809,SYN_4,20171111,-1,0,9,0,612047,0,0,...,0,0,0,0,0,0,0,0,0,09.미사용

In [ ]:
card_sales_10 = pd.read_csv('./data/03.카드 승인매출정보/201810_승인매출정보.csv')
print(card_sales_10.head())

# 컬럼 추출

sales_10 = card_sales_10[cols_sales]
sales_10.head()

In [11]:

cols_sales = [
    '기준년월','발급회원번호','최종이용일자_신판',
    '이용건수_신용_B0M','이용금액_신용_B0M','이용후경과월_신용',
    '이용건수_신용_R12M','이용금액_신용_R12M','이용가맹점수',
    '이용금액_업종기준','이용금액_쇼핑','이용금액_요식','이용금액_교통',
    '이용금액_의료','이용금액_납부','이용금액_교육','이용금액_여유생활',
    '이용금액_사교활동','이용금액_일상생활','이용금액_해외',
    'RP건수_B0M','RP금액_B0M','이용금액대'
]

sales_10 = pd.read_csv(
    './data/03.카드 승인매출정보/201810_승인매출정보.csv',
    usecols=cols_sales
)

sales_10.head()

,기준년월,발급회원번호,최종이용일자_신판,이용건수_신용_B0M,이용금액_신용_B0M,이용후경과월_신용,이용건수_신용_R12M,이용금액_신용_R12M,이용가맹점수,이용금액_업종기준,...,이용금액_의료,이용금액_납부,이용금액_교육,이용금액_여유생활,이용금액_사교활동,이용금액_일상생활,이용금액_해외,RP건수_B0M,RP금액_B0M,이용금액대
0,201810,SYN_0,20181025,7,1344529,0,162,15235678,7,638017,...,46427,202087,0,0,89713,34188,0,2,8647,01.100만원+
1,201810,SYN_1,20181016,11,280142,0,180,6168074,27,1043888,...,89125,225699,0,0,136519,0,0,0,0,03.30만원+
2,201810,SYN_2,20150731,0,0,2,50,1069618,0,0,...,0,0,0,0,0,0,0,0,0,09.미사용
3,201810,SYN_3,20181013,5,47887,4,42,425650,1,63659,...,0,0,0,0,0,0,0,0,0,05.10만원-
4,201810,SYN_4,20171111,-1,0,9,0,591594,0,0,...,0,0,0,0,0,0,0,0,0,09.미사용

In [ ]:
card_sales_11 = pd.read_csv('./data/03.카드 승인매출정보/201811_승인매출정보.csv')
print(card_sales_11.head())

# 컬럼 추출

sales_11 = card_sales_11[cols_sales]
sales_11.head()

In [12]:

cols_sales = [
    '기준년월','발급회원번호','최종이용일자_신판',
    '이용건수_신용_B0M','이용금액_신용_B0M','이용후경과월_신용',
    '이용건수_신용_R12M','이용금액_신용_R12M','이용가맹점수',
    '이용금액_업종기준','이용금액_쇼핑','이용금액_요식','이용금액_교통',
    '이용금액_의료','이용금액_납부','이용금액_교육','이용금액_여유생활',
    '이용금액_사교활동','이용금액_일상생활','이용금액_해외',
    'RP건수_B0M','RP금액_B0M','이용금액대'
]

sales_11 = pd.read_csv(
    './data/03.카드 승인매출정보/201811_승인매출정보.csv',
    usecols=cols_sales
)

sales_11.head()

,기준년월,발급회원번호,최종이용일자_신판,이용건수_신용_B0M,이용금액_신용_B0M,이용후경과월_신용,이용건수_신용_R12M,이용금액_신용_R12M,이용가맹점수,이용금액_업종기준,...,이용금액_의료,이용금액_납부,이용금액_교육,이용금액_여유생활,이용금액_사교활동,이용금액_일상생활,이용금액_해외,RP건수_B0M,RP금액_B0M,이용금액대
0,201811,SYN_0,20181126,7,1335154,0,154,15816617,6,611052,...,0,202763,0,0,0,34467,0,2,7977,01.100만원+
1,201811,SYN_1,20181113,9,262653,0,179,6158926,26,812563,...,88437,229928,0,0,124800,0,0,0,0,03.30만원+
2,201811,SYN_2,20150731,0,0,1,52,1050702,0,135781,...,0,0,0,0,0,0,0,0,0,09.미사용
3,201811,SYN_3,20181104,5,50039,4,42,446810,1,66758,...,0,0,0,0,0,0,0,0,0,05.10만원-
4,201811,SYN_4,20171111,-1,0,9,8,603109,0,0,...,0,0,0,0,0,0,0,0,0,09.미사용

In [ ]:
card_sales_12 = pd.read_csv('./data/03.카드 승인매출정보/201812_승인매출정보.csv')
print(card_sales_12.head())

# 컬럼 추출

sales_12 = card_sales_12[cols_sales]
sales_12.head()

In [ ]:

cols_sales = [
    '기준년월','발급회원번호','최종이용일자_신판',
    '이용건수_신용_B0M','이용금액_신용_B0M','이용후경과월_신용',
    '이용건수_신용_R12M','이용금액_신용_R12M','이용가맹점수',
    '이용금액_업종기준','이용금액_쇼핑','이용금액_요식','이용금액_교통',
    '이용금액_의료','이용금액_납부','이용금액_교육','이용금액_여유생활',
    '이용금액_사교활동','이용금액_일상생활','이용금액_해외',
    'RP건수_B0M','RP금액_B0M','이용금액대'
]

sales_12 = pd.read_csv(
    './data/03.카드 승인매출정보/201812_승인매출정보.csv',
    usecols=cols_sales
)

sales_12.head()

,기준년월,발급회원번호,최종이용일자_신판,이용건수_신용_B0M,이용금액_신용_B0M,이용후경과월_신용,이용건수_신용_R12M,이용금액_신용_R12M,이용가맹점수,이용금액_업종기준,...,이용금액_의료,이용금액_납부,이용금액_교육,이용금액_여유생활,이용금액_사교활동,이용금액_일상생활,이용금액_해외,RP건수_B0M,RP금액_B0M,이용금액대
0,201812,SYN_0,20181224,7,1337016,0,147,16140205,6,595117,...,0,201520,0,0,0,34533,0,1,7467,01.100만원+
1,201812,SYN_1,20181214,9,243960,0,177,6078325,24,899009,...,0,226049,0,0,124997,0,0,0,0,03.30만원+
2,201812,SYN_2,20181225,1,273763,1,29,757181,1,101374,...,0,0,0,0,0,0,0,0,0,05.10만원-
3,201812,SYN_3,20181225,5,48942,5,40,468022,1,71251,...,0,0,0,0,0,0,0,0,0,05.10만원-
4,201812,SYN_4,20171111,-1,0,8,30,673648,0,0,...,0,0,0,0,0,0,0,0,0,09.미사용

In [14]:
card_sales_3 = pd.concat([sales_07, sales_08, sales_09, sales_10, sales_11, sales_12], axis = 0, ignore_index = True)

card_sales_3.head()

,기준년월,발급회원번호,최종이용일자_신판,이용건수_신용_B0M,이용금액_신용_B0M,이용후경과월_신용,이용건수_신용_R12M,이용금액_신용_R12M,이용가맹점수,이용금액_업종기준,...,이용금액_의료,이용금액_납부,이용금액_교육,이용금액_여유생활,이용금액_사교활동,이용금액_일상생활,이용금액_해외,RP건수_B0M,RP금액_B0M,이용금액대
0,201807,SYN_0,20180713,11,1420432,0,165,13391066,6,532697,...,46086,192847,0,0,67281,34349,0,2,14790,01.100만원+
1,201807,SYN_1,20180719,13,286211,0,204,6477338,32,1384347,...,89730,208328,0,0,162964,0,0,0,0,03.30만원+
2,201807,SYN_2,20150731,-3,0,0,-1,904198,5,327673,...,0,0,0,0,70739,0,0,0,0,04.10만원+
3,201807,SYN_3,20180728,5,28771,4,44,257478,1,49490,...,0,0,0,0,0,0,0,0,0,05.10만원-
4,201807,SYN_4,20171111,-1,0,8,4,664057,0,0,...,0,0,0,0,0,0,0,0,0,09.미사용

In [15]:
card_sales_3['기준년월'].value_counts().sort_index()

기준년월
201807    3000000
201808    3000000
201809    3000000
201810    3000000
201811    3000000
201812    3000000
Name: count, dtype: int64

In [18]:
card_sales_3.tail()

,기준년월,발급회원번호,최종이용일자_신판,이용건수_신용_B0M,이용금액_신용_B0M,이용후경과월_신용,이용건수_신용_R12M,이용금액_신용_R12M,이용가맹점수,이용금액_업종기준,...,이용금액_의료,이용금액_납부,이용금액_교육,이용금액_여유생활,이용금액_사교활동,이용금액_일상생활,이용금액_해외,RP건수_B0M,RP금액_B0M,이용금액대
17999995,201812,SYN_2999995,20181030,-2,0,12,0,0,0,0,...,0,0,0,0,0,0,0,0,0,09.미사용
17999996,201812,SYN_2999996,20181226,42,1155995,0,476,13284032,17,1669778,...,91794,126511,0,0,136844,0,0,3,98028,01.100만원+
17999997,201812,SYN_2999997,20181225,23,672375,0,287,9660844,33,2081545,...,90582,220789,0,0,169059,34936,0,0,0,02.50만원+
17999998,201812,SYN_2999998,20181231,11,209431,0,182,3383113,29,666946,...,0,192339,0,0,106859,0,76793,1,43536,04.10만원+
17999999,201812,SYN_2999999,20181218,3,0,1,130,2258942,2,0,...,0,0,0,0,0,0,0,0,0,09.미사용

In [17]:
card_sales_3.to_csv('./data/2018_승인매출정보_통합.csv',
                       index=False,
                       encoding='utf-8-sig')